package ru.itmo.lessons.lesson10;

public enum Priority {
    //  перечисление может имплементировать интерфейс и реализовывать абстрактные методы,
    //  может создаваться с любыми свойствами, конструкторами и методами
    //  наследование запрещено, так как оно уже есть

     HICH(30),MEDIUM(20),LOW(10); //экземпляры типа Priority


    // обьявляем свойство по умолчанию 0, значит у каждого обьекта
    // появилось свойство code. HICH.code,MEDIUM.code,LOW.code
    //  методы доступны всем элементам(экземплярам) перечисления. Нпример: HICH.getCode
    private int code;

    Priority(int code){   // модификатор доступа конструктора всегда private
        // какие-то инструкции
        this.code = code;
    };

    public int getCode() {
        return code;
    }
}
